;自定义文件
;本文件对应基本设置与单独Skin组件
;如需修改MainPanel，请去往CustomMainPanel.ini
[Variables]

;用户信息
UserName = 巴别塔的箱子
UserID = ID:48033414
UserBadge = #@#Images\RHODES_ISLAND.png
;--------------------


;边角按钮
;Y轴偏移，如果你修改了按钮图标，用这个选项矫正高度。
BtnCornerOffsetY = 0

BtnCorner1Icon = #@#Icons\Options.png
BtnCorner1Action = [ms-settings:]

BtnCorner2Icon = #@#Icons\Announce.png
BtnCorner2Action = [ms-settings:about]

BtnCorner3Icon = #@#Icons\Mail.png
BtnCorner3Action = [mailto:]

BtnCorner4Icon = #@#Icons\Calendar.png
BtnCorner4Action = [outlookcal:]
;--------------------


;新闻幻灯片
;自定义图片路径
SliderImg1 = 
SliderImg2 = 
SliderImg3 = 
SliderImg4 = 
;--------------------


;音乐终端
;开关频谱可视化
ShowVis = 0

;设置播放器，支持: AIMP iTunes Spotify Winamp WMP (在下方填写)
;填写CAD将支持: MusicBee foobar2000 (foobar2000需安装foo_cad组件)
PlayerSet = CAD

MusicTerminalText = 音角
MusicTerminalIcon = #@#Icons\Combat.png
MusicTerminalSanLabel = 进度
MusicTerminalLabel = 当前
MusicTerminalTextLabelNowIdle = 全部完成
MusicTerminalAction = []
;--------------------


;"Clostore"
;填写Steam个人资料页面的链接，显示最近运行过的两款游戏。
;需在隐私设置中公开游戏详情。
SteamProfileURL = 

SteamTerminalText = Clostore
SteamTerminalIcon = #@#Icons\Combat.png
SteamTerminalSanLabel = 理智
SteamTerminalLabel = 当前
SteamTerminalTextLabelNowIdle = 全部完成
SteamTerminalAction = [steam://open/games]
;--------------------


;按钮。
Button1Text = 编队
Button1Icon = #@#Icons\Squads.png
Button1Action = []

Button2Text = 干员
Button2Icon = #@#Icons\Operator.png
Button2Action = []
;--------------------


;龙门币色按钮
BrowserText = 网络浏览
BrowserIcon = #@#Icons\Store.png
BrowserAction = [http:]

LinksText = 链接
LinksIcon = #@#Icons\Recruitment.png
LinksAction = []

Link1Text = 蜜饼唤来
Link1Icon = #@#Icons\Recruit.png
Link1Action = [https://space.bilibili.com/161775300/dynamic]

Link2Text = Wiki
Link2Icon = #@#Icons\Headhunt.png
Link2Action = [https://prts.wiki]
;--------------------


;任务按钮
ButtonDText = 任务
ButtonDIcon = #@#Icons\Mission.png
ButtonDAction = [taskmgr]
;--------------------


;储存监控按钮
StorageText = 存储
StorageIcon = #@#Icons\Base.png
StorageAction = [::{20D04FE0-3AEA-1069-A2D8-08002B30309D}]

BinText = 回收
BinIcon = #@#Icons\Depot.png
BinAction = [::{645ff040-5081-101b-9f08-00aa002f954e}]
;--------------------


;不保修项目
;简易MagicMeter开关，使用需要安装ImageMagick。
;将渲染更多效果，但请小心你的硬盘(Temp目录)
;交换下行的注释状态开启/关闭
;@Include1 = #@#Modules\MagickMeter.ini
;--------------------